{"number":"707","title":"Design Linked List","url":"https://leetcode.com/problems/design-linked-list","difficulty":"Easy","question":"Design your&#xA0;implementation of the linked list. You can choose to use the singly linked list or the doubly linked list. A node in a singly&#xA0;linked list should have two attributes: val&#xA0;and next. val is the value of the current node, and next&#xA0;is&#xA0;a&#xA0;pointer/reference to the next node. If you want to use the doubly linked list,&#xA0;you will need&#xA0;one more attribute prev to indicate the previous node in the linked list. Assume all nodes in the linked list are 0-indexed.\n\nImplement these functions in your linked list class:\n\n\n\tget(index) : Get the value of&#xA0;the index-th&#xA0;node in the linked list. If the index is invalid, return -1.\n\taddAtHead(val) : Add a node of value val&#xA0;before the first element of the linked list. After the insertion, the new node will be the first node of the linked list.\n\taddAtTail(val) : Append a node of value val&#xA0;to the last element of the linked list.\n\taddAtIndex(index, val) : Add a node of value val&#xA0;before the index-th&#xA0;node in the linked list.&#xA0;If index&#xA0;equals&#xA0;to the length of&#xA0;linked list, the node will be appended to the end of linked list. If index is greater than the length, the node will not be inserted. If index is negative, the node will be inserted at the head&#xA0;of the list.\n\tdeleteAtIndex(index) : Delete&#xA0;the index-th&#xA0;node in the linked list, if the index is valid.\n\n\nExample:\n\nMyLinkedList linkedList = new MyLinkedList();\nlinkedList.addAtHead(1);\nlinkedList.addAtTail(3);\nlinkedList.addAtIndex(1, 2);  // linked list becomes 1-&gt;2-&gt;3\nlinkedList.get(1);            // returns 2\nlinkedList.deleteAtIndex(1);  // now the linked list is 1-&gt;3\nlinkedList.get(1);&#xA0;&#xA0;&#xA0;         // returns 3\n\n\nNote:\n\n\n\tAll values will be in the range of [1, 1000].\n\tThe number of operations will be in the range of&#xA0;[1, 1000].\n\tPlease do not use the built-in LinkedList library.\n\n","code":"undefinedpublic class MyLinkedList {​    /** Initialize your data structure here. */    public MyLinkedList() {            }        /** Get the value of the index-th node in the linked list. If the index is invalid, return -1. */    public int Get(int index) {            }        /** Add a node of value val before the first element of the linked list. After the insertion, the new node will be the first node of the linked list. */    public void AddAtHead(int val) {            }        /** Append a node of value val to the last element of the linked list. */    public void AddAtTail(int val) {            }        /** Add a node of value val before the index-th node in the linked list. If index equals to the length of linked list, the node will be appended to the end of linked list. If index is greater than the length, the node will not be inserted. */    public void AddAtIndex(int index, int val) {            }        /** Delete the index-th node in the linked list, if the index is valid. */    public void DeleteAtIndex(int index) {            }}​/** * Your MyLinkedList object will be instantiated and called as such: * MyLinkedList obj = new MyLinkedList(); * int param_1 = obj.Get(index); * obj.AddAtHead(val); * obj.AddAtTail(val); * obj.AddAtIndex(index,val); * obj.DeleteAtIndex(index); */"}