{"number":"722","title":"Remove Comments","url":"https://leetcode.com/problems/remove-comments","difficulty":"Medium","question":"Given a C++ program, remove comments from it. The program source is an array where source[i] is the i-th line of the source code.  This represents the result of splitting the original source code string by the newline character \\n.\n\nIn C++, there are two types of comments, line comments, and block comments.\n\nThe string // denotes a line comment, which represents that it and rest of the characters to the right of it in the same line should be ignored.\n\nThe string /* denotes a block comment, which represents that all characters until the next (non-overlapping) occurrence of */ should be ignored.  (Here, occurrences happen in reading order: line by line from left to right.)  To be clear, the string /*/ does not yet end the block comment, as the ending would be overlapping the beginning.\n\nThe first effective comment takes precedence over others: if the string // occurs in a block comment, it is ignored. Similarly, if the string /* occurs in a line or block comment, it is also ignored.\n\nIf a certain line of code is empty after removing comments, you must not output that line: each string in the answer list will be non-empty.\n\nThere will be no control characters, single quote, or double quote characters.  For example, source = &quot;string s = &quot;/* Not a comment. */&quot;;&quot; will not be a test case.  (Also, nothing else such as defines or macros will interfere with the comments.)\n\nIt is guaranteed that every open block comment will eventually be closed, so /* outside of a line or block comment always starts a new comment.\n\nFinally, implicit newline characters can be deleted by block comments.  Please see the examples below for details.\n\n\nAfter removing the comments from the source code, return the source code in the same format.\n\nExample 1:\nInput: \nsource = [&quot;/*Test program */&quot;, &quot;int main()&quot;, &quot;{ &quot;, &quot;  // variable declaration &quot;, &quot;int a, b, c;&quot;, &quot;/* This is a test&quot;, &quot;   multiline  &quot;, &quot;   comment for &quot;, &quot;   testing */&quot;, &quot;a = b + c;&quot;, &quot;}&quot;]\n\nThe line by line code is visualized as below:\n/*Test program */\nint main()\n{ \n  // variable declaration \nint a, b, c;\n/* This is a test\n   multiline  \n   comment for \n   testing */\na = b + c;\n}\n\nOutput: [&quot;int main()&quot;,&quot;{ &quot;,&quot;  &quot;,&quot;int a, b, c;&quot;,&quot;a = b + c;&quot;,&quot;}&quot;]\n\nThe line by line code is visualized as below:\nint main()\n{ \n  \nint a, b, c;\na = b + c;\n}\n\nExplanation: \nThe string /* denotes a block comment, including line 1 and lines 6-9. The string // denotes line 4 as comments.\n\n\n\nExample 2:\nInput: \nsource = [&quot;a/*comment&quot;, &quot;line&quot;, &quot;more_comment*/b&quot;]\nOutput: [&quot;ab&quot;]\nExplanation: The original source string is &quot;a/*comment\\nline\\nmore_comment*/b&quot;, where we have bolded the newline characters.  After deletion, the implicit newline characters are deleted, leaving the string &quot;ab&quot;, which when delimited by newline characters becomes [&quot;ab&quot;].\n\n\n\nNote:\nThe length of source is in the range [1, 100].\nThe length of source[i] is in the range [0, 80].\nEvery open block comment is eventually closed.\nThere are no single-quote, double-quote, or control characters in the source code.\n","code":"undefinedpublic class Solution {    public IList<string> RemoveComments(string[] source) {            }}"}