{
    "number": "731",
    "title": "My Calendar II",
    "url": "https://leetcode.com/problems/my-calendar-ii",
    "difficulty": "Medium",
    "question": "Implement a MyCalendarTwo class to store your events. A new event can be added if adding the event will not cause a triple booking.\n\nYour class will have one method, book(int start, int end). Formally, this represents a booking on the half open interval [start, end), the range of real numbers x such that start &lt;= x &lt; end.\n\nA triple booking happens when three events have some non-empty intersection (ie., there is some time that is common to all 3 events.)\n\nFor each call to the method MyCalendar.book, return true if the event can be added to the calendar successfully without causing a triple booking. Otherwise, return false and do not add the event to the calendar.\nYour class will be called like this: MyCalendar cal = new MyCalendar(); MyCalendar.book(start, end)\n\nExample 1:\n\nMyCalendar();\nMyCalendar.book(10, 20); // returns true\nMyCalendar.book(50, 60); // returns true\nMyCalendar.book(10, 40); // returns true\nMyCalendar.book(5, 15); // returns false\nMyCalendar.book(5, 10); // returns true\nMyCalendar.book(25, 55); // returns true\nExplanation: \nThe first two events can be booked.  The third event can be double booked.\nThe fourth event (5, 15) can&apos;t be booked, because it would result in a triple booking.\nThe fifth event (5, 10) can be booked, as it does not use time 10 which is already double booked.\nThe sixth event (25, 55) can be booked, as the time in [25, 40) will be double booked with the third event;\nthe time [40, 50) will be single booked, and the time [50, 55) will be double booked with the second event.\n\n\n&#xA0;\n\nNote:\n\n\n\tThe number of calls to MyCalendar.book per test case will be at most 1000.\n\tIn calls to MyCalendar.book(start, end), start and end are integers in the range [0, 10^9].\n\n\n&#xA0;",
    "code": "undefinedpublic class MyCalendarTwo {​    public MyCalendarTwo() {            }        public bool Book(int start, int end) {            }}​/** * Your MyCalendarTwo object will be instantiated and called as such: * MyCalendarTwo obj = new MyCalendarTwo(); * bool param_1 = obj.Book(start,end); */"
}