{
    "number": "871",
    "title": "Minimum Number of Refueling Stops",
    "url": "https://leetcode.com/problems/minimum-number-of-refueling-stops",
    "difficulty": "Hard",
    "question": "A car travels from a starting position to a destination which is target miles east of the starting position.\n\nAlong the way, there are gas stations.&#xA0; Each station[i]&#xA0;represents a gas station that is station[i][0] miles east of the starting position, and has station[i][1] liters of gas.\n\nThe car starts with an infinite tank of gas, which initially has&#xA0;startFuel&#xA0;liters of fuel in it.&#xA0; It uses 1 liter of gas per 1 mile that it drives.\n\nWhen the car&#xA0;reaches a gas station, it may stop and refuel, transferring all the gas from the station into the car.\n\nWhat is the least number of refueling stops the car must make in order to reach its destination?&#xA0; If it cannot reach the destination, return -1.\n\nNote that if the car reaches a gas station with 0 fuel left, the car can still refuel there.&#xA0; If the car reaches the destination with 0 fuel left, it is still considered to have arrived.\n\n&#xA0;\n\n\nExample 1:\n\nInput: target = 1, startFuel = 1, stations = []\nOutput: 0\nExplanation: We can reach the target without refueling.\n\n\n\nExample 2:\n\nInput: target = 100, startFuel = 1, stations = [[10,100]]\nOutput: -1\nExplanation: We can&apos;t reach the target (or even the first gas station).\n\n\n\nExample 3:\n\nInput: target = 100, startFuel = 10, stations = [[10,60],[20,30],[30,30],[60,40]]\nOutput: 2\nExplanation: \nWe start with 10 liters of fuel.\nWe drive to position 10, expending 10 liters of fuel.  We refuel from 0 liters to 60 liters of gas.\nThen, we drive from position 10 to position 60 (expending 50 liters of fuel),\nand refuel from 10 liters to 50 liters of gas.  We then drive to and reach the target.\nWe made 2 refueling stops along the way, so we return 2.\n\n\n&#xA0;\n\nNote:\n\n\n\t1 &lt;= target, startFuel, stations[i][1] &lt;= 10^9\n\t0 &lt;= stations.length &lt;= 500\n\t0 &lt; stations[0][0] &lt; stations[1][0] &lt; ... &lt; stations[stations.length-1][0] &lt; target\n\n\n\n\n",
    "code": "undefinedpublic class Solution {    public int MinRefuelStops(int target, int startFuel, int[][] stations) {            }}"
}